## Semester 1 Project Submission

Please fill out:
* Student name: 
* Instructor name:

## Importing Python libraries

In [1]:
# In this cell we import the libraries needed for our analysis
# pandas for data frame manipulation and import
# sqlite3 for database connection, import and manipulation
# numpy for array-wise operations
# plt and sns for plotting data or data frames

import pandas as pd
import sqlite3
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

## Importing csv and tsv files

In this step, we will import data using the pandas library.
For that, there are two alternatives to import data:
1. bomDF = pd.read_csv("zippedData/bom.movie_gross.csv.gz", encoding="unicode_escape") --> for compressed files
2. bomDF = pd.read_csv("zippedData/bom.movie_gross.csv") --> for uncompressed (raw) files

In [2]:
# DataFrame from Box Office Mojo dataset
bomDF = pd.read_csv("zippedData/bom.movie_gross.csv.gz",encoding="unicode_escape")
bomDF.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

- Box Office Mojo dataset is not suitable to obtain genre information

In [3]:
# DataFrame from Rotten Tomatoes dataset
rtDF = pd.read_csv("zippedData/rt.movie_info.tsv.gz", sep='\t', encoding="unicode_escape")
rtDF.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [9]:
rtDF["genre"].value_counts().head()

Drama                                151
Comedy                               110
Comedy|Drama                          80
Drama|Mystery and Suspense            67
Art House and International|Drama     62
Name: genre, dtype: int64

- Rotten Tomatoes dataset is suitable to obtain genre information

In [10]:
# DataFrame from TheMovieDB dataset
tmdbDF = pd.read_csv("zippedData/tmdb.movies.csv")
tmdbDF.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [ ]:
tmdbDF.describe

In [11]:
# DataFrame from The Numbers dataset
tnDF = pd.read_csv("zippedData/tn.movie_budgets.csv")
tnDF.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [ ]:
tnDF.describe

## Importing database

Here, we import data from IMDB's SQLite database using sqlite3 library.

In [ ]:
# DataFrame from IMDB dataset
conn = sqlite3.connect('zippedData/im.db')

In [ ]:
movie_basicsDF = pd.read_sql("select * from movie_basics", con=conn)
movie_basicsDF.head()

In [ ]:
personsDF = pd.read_sql("select * from persons", con=conn)
personsDF.head()

In [ ]:
movie_ratingsDB = pd.read_sql("select * from movie_ratings", con=conn)
movie_ratingsDB.head()

# Relationship between genre and revenues

- Does a movie's genre have an impact in mean gross revenues?
- Top 5 genres with most gross revenues (info from 2020 and 2021)